//PROC1    JOB '',CLASS=A,MSGCLASS=A,TIME=(0,01),NOTIFY=&SYSUID  
//         JCLLIB ORDER='ALU0547.RENATO.SOURCE.JCLPROC'          
//STEP1    EXEC PROC1,ARQUIVO='ALU0547.RENATO.TESTPROC'          