//DELETJB  JOB  DELETA,CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=ALU0410 
//STEP1    EXEC PGM=IEFBR14                                             
//DELDD    DD   DSN=ALU0410.RENATO.MYSYSIN,DISP=(OLD,DELETE,DELETE)     