//JCLGDG    JOB 'CRIAGDG',CLASS=C,MSGCLASS=C,NOTIFY=&SYSUID            
//STEP1     EXEC PGM=IDCAMS                                            
//SYSPRINT  DD SYSOUT=*                                                
//SYSIN     DD *                                                       
 DELETE ALU0410.RENATO.RENATO.BASEGDG GDG FORCE                        