//JCLVSAM   JOB 'CRIAVSAM',CLASS=C,MSGCLASS=C,NOTIFY=&SYSUID  
//STEP1     EXEC PGM=IDCAMS                                   
//SYSPRINT  DD SYSOUT=*                                       
//ARQIN     DD DSN=ALU0547.RENATO.MYSYS.ARQVSA2.KSDS,DISP=OLD 
//ARQOUT    DD DSN=ALU0547.RENATO.MYSYS.OUTPUT,DISP=OLD       
//SYSIN     DD *                                              
 REPRO IFILE(ARQIN)  OFILE(ARQOUT)                            